STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_SerialCom_Central/STM32_BLE/App/app_ble.c
          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                        p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
        }
        break;
      case ACI_GATT_SRV_READ_VSEVT_CODE :
        {
          APP_DBG_MSG(">>== ACI_GATT_SRV_READ_VSEVT_CODE\n");

          aci_gatt_srv_read_event_rp0    *p_read;
          p_read = (aci_gatt_srv_read_event_rp0*)p_blecore_evt->data;
          uint8_t error_code = BLE_ATT_ERR_INSUFF_AUTHORIZATION;

          APP_DBG_MSG("Handle 0x%04X\n",  p_read->Attribute_Handle);

          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_1*/

          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_1*/

          aci_gatt_srv_resp(p_read->Connection_Handle,
                            p_read->CID,
                            p_read->Attribute_Handle,
                            error_code,
                            0,
                            NULL);

          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_2*/

          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_2*/
          break;
        }
        /* USER CODE BEGIN EVT_VENDOR_1 */
      case ACI_L2CAP_COS_CONNECTION_RESP_VSEVT_CODE:
        {
          aci_l2cap_cos_connection_resp_event_rp0 *p_l2cap_cos_connection;
          p_l2cap_cos_connection = (aci_l2cap_cos_connection_resp_event_rp0 *) p_blecore_evt->data;
          
          APP_DBG_MSG(">>== ACI_L2CAP_COS_CONNECTION_RESP_VSEVT_CODE\n");
          APP_DBG_MSG("Channel_Type: %d\nPeer_MTU: %d\nPeer_MPS: %d\nInitial_Credits:%d\nResult: 0x%02X\nCID_Count: %d\n",
                      p_l2cap_cos_connection->Channel_Type,
                      p_l2cap_cos_connection->Peer_MTU, 
                      p_l2cap_cos_connection->Peer_MPS, 
                      p_l2cap_cos_connection->Initial_Credits, 
                      p_l2cap_cos_connection->Result,
                      p_l2cap_cos_connection->CID_Count);
          if(p_l2cap_cos_connection->CID_Count > 0)
          {
            
            BleCoCContextCentral.Conn_Handle = p_l2cap_cos_connection->Connection_Handle;
            BleCoCContextCentral.Peer_Max_Transmission_Unit = p_l2cap_cos_connection->Peer_MTU;
            BleCoCContextCentral.Channel_ID = p_l2cap_cos_connection->CID[0];
            BleCoCContextCentral.cocFlag = 1;
            
            APP_DBG_MSG("==>> Connection Oriented Channel established\n");
          }          
        }
         break;
        
      case ACI_L2CAP_COS_SDU_DATA_RX_VSEVT_CODE:
        {
          aci_l2cap_cos_sdu_data_rx_event_rp0 *p_l2cap_sdu_data_rx_event;
          p_l2cap_sdu_data_rx_event = (aci_l2cap_cos_sdu_data_rx_event_rp0 *) p_blecore_evt->data;

          tBleStatus ret;
          
          HandleNotification.CoC_Evt_Opcode = L2CAP_DATA_RECEIVED;
          HandleNotification.ConnectionHandle = p_l2cap_sdu_data_rx_event->Connection_Handle; //bleAppContext.BleApplicationContext_legacy.connectionHandle;
          HandleNotification.DataLength = p_l2cap_sdu_data_rx_event->SDU_Length;
          
          ret = aci_l2cap_cos_sdu_data_extract(p_l2cap_sdu_data_rx_event->Connection_Handle, 
                                               p_l2cap_sdu_data_rx_event->CID, 
                                               MAX_SDU_SIZE,
                                               HandleNotification.DataTable,
                                               &HandleNotification.DataLength);
          
          if(ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("aci_l2cap_cos_sdu_data_extract: fail, reason: 0x%02X\n", ret);
            return;
          }
          
          /* central */
          COC_CENTRAL_APP_Notification(&HandleNotification);
        }
        break;    
        /* USER CODE END EVT_VENDOR_1 */
      default:
        /* USER CODE BEGIN EVT_VENDOR_DEFAULT */
        APP_DBG_MSG("HCI_VENDOR_EVT: 0x%04X\n", p_blecore_evt->ecode);
        /* USER CODE END EVT_VENDOR_DEFAULT */
        break;
      }
    } /* HCI_VENDOR_EVT_CODE */
    break;

  case HCI_HARDWARE_ERROR_EVT_CODE:
    {
      hci_hardware_error_event_rp0 *p_hci_hardware_error_event;
      p_hci_hardware_error_event = (hci_hardware_error_event_rp0*)p_event_pckt->data;

      if (p_hci_hardware_error_event->Hardware_Code <= 0x03)
      {
        NVIC_SystemReset();
      }
    }
    break;

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

  default:
    /* USER CODE BEGIN ECODE_DEFAULT*/
    APP_DBG_MSG("HCI_EVENT: 0x%02X\n", p_event_pckt->evt);
    /* USER CODE END ECODE_DEFAULT*/
    break;
  }
}

static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Role,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Conn_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout)
{
  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE_1 */

  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE_1 */
  APP_DBG_MSG(">>== hci_le_connection_complete_event - Connection handle: 0x%04X\n", Connection_Handle);
  APP_DBG_MSG("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
              Peer_Address[5],
              Peer_Address[4],
              Peer_Address[3],
              Peer_Address[2],
              Peer_Address[1],
              Peer_Address[0]);
   APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
               INT(Conn_Interval*1.25),
               FRACTIONAL_2DIGITS(Conn_Interval*1.25),
               Peripheral_Latency,
               Supervision_Timeout * 10
                 );

   if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
   {
     /* Connection as client */
     bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
   }
   else
   {
     /* Connection as server */
     bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
   }
   bleAppContext.BleApplicationContext_legacy.connectionHandle = Connection_Handle;

   GATT_CLIENT_APP_Set_Conn_Handle(0, Connection_Handle);

   /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
   
   if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
   {
     UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);
   }
   
   HandleNotification.ConnectionHandle = bleAppContext.BleApplicationContext_legacy.connectionHandle;
   
   /* Connection as central */
   HandleNotification.CoC_Evt_Opcode = BLE_CONN_HANDLE_EVT;
   
