STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_SerialCom_Central/STM32_BLE/App/app_ble.c
static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */
void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle, uint16_t conn1, uint16_t conn2)
{
    tBleStatus ret;

    ret = aci_l2cap_connection_parameter_update_req(ConnectionHandle,
                                                    conn1, conn2,
                                                    0, 0x3E8);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed\n");
    }
    else
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully\n");
    }

  BLEStack_Process_Schedule();
  return;
}

void COC_CENTRAL_APP_Notification(COC_APP_ConnHandle_Not_evt_t *pNotification)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t i;

  switch(pNotification->CoC_Evt_Opcode)
  {    
  case BLE_CONN_HANDLE_EVT :    
    BleCoCContextCentral.Conn_Handle = pNotification->ConnectionHandle;
    
    break;
  
  case BLE_CONN_UPDATE_EVT:
    
    if (BleCoCContextCentral.cocFlag != 1)
    {
      BleCoCContextCentral.SPSM = 0x80;
    
      APP_DBG_MSG("==>> Start Connection Oriented Channel\n");
      ret = aci_l2cap_cos_connection_req(BleCoCContextCentral.Conn_Handle,
                                         BleCoCContextCentral.SPSM,
                                         MAX_SDU_SIZE,
                                         64,
                                         CFG_L2CAP_CHANNEL_TYPE,
                                         1);
      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("  Fail   : aci_l2cap_cos_connection_req command, result: 0x%02X\n", ret);
      }
      else
      {
        APP_DBG_MSG("  Success: aci_l2cap_cos_connection_req command\n");
      }
    }
    break;

    case BLE_DISCON_HANDLE_EVT :
      {
        BSP_LED_Off(LED_BLUE); 
      }
      break;
      
    case L2CAP_DATA_RECEIVED:
    {
      /* display received data */
      for (i = 0 ; i < pNotification->DataLength ; i++)
      {
        APP_DBG_MSG("%c", pNotification->DataTable[i]);
      }
    }
    break;

    default:
      break;
  }
  return;
}

static uint8_t analyse_adv_report(uint8_t adv_data_size, uint8_t *p_adv_data,
                                  uint8_t address_type, uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;

  while(i < adv_data_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
    
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        if ((ad_length >= 7) && 
            (p_adv_data[i + 2] == 0x30) &&
            (p_adv_data[i + 3] == 0x00) &&
            (p_adv_data[i + 4] == 0x02) /* blueST v2*/)
        {
          APP_DBG_MSG("--- ST MANUFACTURER data BlueSTv2\n");
          if(p_adv_data[i + 6] == CFG_DEV_ID_BLE_COC)
          {
            bleAppContext.deviceServerBdAddrType = address_type;
            memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
            
            bleAppContext.deviceServerFound = 0x01;
            
            APP_DBG_MSG("  Serial Port Server, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                        bleAppContext.a_deviceServerBdAddr[5],
                        bleAppContext.a_deviceServerBdAddr[4],
                        bleAppContext.a_deviceServerBdAddr[3],
                        bleAppContext.a_deviceServerBdAddr[2],
                        bleAppContext.a_deviceServerBdAddr[1],
                        bleAppContext.a_deviceServerBdAddr[0]);
            found_status = 1;
        }
        else
        {
          APP_DBG_MSG("-- COC peripheral not detected\n");
        }        
        break;
      }
      } 
    default:
      break;
    }/* end of switch*/
    
    i += ad_length + 1; /* increment the iterator to go on next element*/
    
    if (found_status != 0)
    {
      break;
    }
    
  }/* end of while*/

  return found_status;
}

static void Connect_Request(void)
{
  tBleStatus result;
  
  if (bleAppContext.deviceServerFound != 0)
  {
    APP_DBG_MSG("Create connection to Serial Port Server\n");
    
    result = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 
                                            0x00, //SCAN_ACCEPT_ALL, 
                                            LE_1M_PHY_BIT, 
                                            HCI_SCAN_TYPE_PASSIVE,
                                            SCAN_INT_MS(500), 
                                            SCAN_WIN_MS(500));
    if (result != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_set_scan_configuration - fail, result: 0x%02X\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
    }
    
    result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                  CONN_INT_MS(50u), CONN_INT_MS(50u),
                                                  0u,
                                                  CONN_SUP_TIMEOUT_MS(5000u),
                                                  CONN_CE_LENGTH_MS(50u), CONN_CE_LENGTH_MS(50u));
    
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02x\n", result);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02x\n", result);
    }  
    result = aci_gap_create_connection(LE_1M_PHY_BIT,
                                       bleAppContext.deviceServerBdAddrType,
                                       &bleAppContext.a_deviceServerBdAddr[0]);    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
      APP_DBG_MSG("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
      UTIL_SEQ_WaitEvt(1u << CFG_IDLEEVT_CONNECTION_COMPLETE);
    }
    else
    {
      APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02x\n", result);
      BSP_LED_On(LED_RED);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;      
    }
  }

  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

